import pandas as pd

df = pd.DataFrame([['Алиса', 1, 5, 4, 5, 3],
                        ['Андрей', 5, 3, 4, 3, 3],
                        ['Елена', 5, 5, 5, 5, 5],
                        ['Елисей', 5, 4, 4, 5, 5],
                        ['Игорь', 2, 3, 2, 2, 1],
                        ['Ксения', 2, 2, 3, 2, 5],
                        ['Николай', 4, 4, 5, 4, 3],
                        ['Сергей', 3, 3, 3, 3, 3],
                        ['Татьяна', 3, 4, 3, 3, 4],
                        ['Юрий', 1, 2, 3, 4, 5]],
columns=['Имя', 'Математика', 'Литература', 'Физика', 'Химия', 'Информатика'])
print(df)
print(df.describe())
df.set_index('Имя', inplace=True)
for i in df.columns:
    print(f"\nСтатистика по предмету - {i}:")
    print(f"Средняя оценка - {df[i].mean()}")
    print(f"Медианная оценка - {df[i].median()}")
    print(f"Первый квартиль - {df[i].quantile(0.25)}")
    print(f"Третий квартиль - {df[i].quantile(0.75)}")
    print(f"Межквартильный размах - {df[i].quantile(0.75) - df[i].quantile(0.25)}")
    print(f"Стандартное отклонение - {df[i].std():.3f}")
